# Taps
# tap 'homebrew/cask'
# tap 'homebrew/cask-eid'
# tap 'homebrew/cask-versions'
# tap 'homebrew/bundle'

# Binaries
brew 'wget'
brew 'git'
brew 'zsh'

# brew 'httpie'
# brew 'awscli'
# brew 'bash' # Latest Bash version
# brew 'bat' # "cat" on steroids
# brew 'coreutils' # Those that come with macOS are outdated
# brew 'gnupg2'
# brew 'grep'
# brew 'hub'
# brew 'mackup'
# brew 'mas' # Mac App Store manager
# brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
# brew 'trash' # Manage the Trash bin
# brew 'tree' # List directories in a tree structure
# brew 'zlib' # Needed for Memcached

# Development
# brew 'php' #latest version
brew 'php@7.3'
brew 'composer'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
# brew 'elasticsearch'

# Apps
# cask 'aerial'
# cask 'alfred'
# cask 'bartender'
# cask 'caffeine'
# cask 'discord'
# cask 'docker'
# cask 'firefox'
# cask 'github'
cask 'google-backup-and-sync'
cask 'google-chrome'
# cask 'gpg-suite'
# cask 'insomnia'
# cask 'java'
# cask 'mysqlworkbench'
cask 'phpstorm'
# cask 'skype'
cask 'slack'
cask 'gitkraken'
# cask 'google-backup-and-sync'
# cask 'sublime-text'
# cask 'tableplus'
# cask 'telegram-desktop'
# cask 'tor-browser'
# cask 'transmission'
# cask 'transmit'
# cask 'vagrant'
# cask 'virtualbox' # Might need to allow access in Security settings
# cask 'virtualbox-extension-pack'
cask 'vlc'

# Fonts

# tap 'caskroom/fonts'
# cask 'font-fira-code'
# cask 'font-m-plus'
# cask 'font-hack'
# cask 'font-iosevka'
# cask 'font-ubuntu'
# cask 'font-input'

# tap 'homebrew/cask-fonts'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'